SpatialElementType Property
 The spatial element type.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  Since:  2023
 Syntax
  C#
public SpatialElementType SpatialElementType { get; }
  Visual Basic
Public ReadOnly Property SpatialElementType As SpatialElementType
	Get
  Visual C++
public:
property SpatialElementType SpatialElementType {
	SpatialElementType get ();
}
 See Also
  SpatialElement Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →